# Data-Wrangling
- pip install pandas
- pip install numpy
- pip install seabon

In [318]:
# import Libraries
import pandas as pd
import numpy as n
import seaborn as sns

In [319]:
ds = sns.load_dataset('titanic')
ds1 = ds
ds2 = ds
ds4 = sns.load_dataset('titanic')

In [320]:
ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [321]:
#  Math operations
(ds["fare"]+1).head()

0     8.2500
1    72.2833
2     8.9250
3    54.1000
4     9.0500
Name: fare, dtype: float64

In [322]:
# Check all null or missing values in dataset
ds.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# how to tackle missing values

## 1. drop selected feature with missing values

In [323]:
# 1. drop selected feature with missing values
ds.dropna(subset=["deck"], axis=0 , inplace=True)
ds.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [324]:
ds.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [325]:
# remove all Na values from dataset
ds = ds.dropna()

In [326]:
ds.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [327]:
ds.shape

(182, 15)

## 2. replace selected features missing values with its average

In [328]:
# using mean to replace nan values of selceted feature
import numpy as np
import math

mean = ds1["age"].mean()
mean = round(mean)
ds1["age"] = ds1["age"].replace(np.nan , mean)
mean

36

In [329]:
ds1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [330]:
ds1.shape

(203, 15)

In [331]:
ds1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [332]:
# droping embarked feature values
ds1.dropna(subset=["embarked"], axis=0 , inplace=True)

In [333]:
ds1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [334]:
ds1.shape

(201, 15)

In [335]:
# store data set in csv file
ds1.to_csv("titanic.csv")

# Data-Formating

In [336]:

ds1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [337]:
# Changing data types of selected features
# ds1["age"] = ds1["age"].astype(int)
# ds1["age"].dtypes

In [338]:
# Changing label of slelcted feature
ds1["age"]= (ds1["age"]*365).astype(int)
ds1.rename(columns={"age": "age_in_days"}, inplace=True)
ds1.head()

,survived,pclass,sex,age_in_days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

# Data-Normalizaiton
- Normal data have bell curve shape
- uniform data
- having ranges of same size for its impect

In [339]:
ds3 = ds1[['age_in_days', 'fare', 'survived']]
ds3.head()

    age_in_days     fare  survived
1         13870  71.2833         1
3         12775  53.1000         1
6         19710  51.8625         0
10         1460  16.7000         1
11        21170  26.5500         1

## Methods fo data-normalization
- scaling data by its features (simple feature scaling)
  - newValue = Oldvalue / median(max value)
- Min-Max Scaling
- Z-Score
- Log Tronsformation
- Power Transformation

In [340]:
 #  data normalization through simple featiure scaling (Features Value ranges are in b/w 0 - 1)
 ds3['fare'] = ds3['fare']/ds3['fare'].max()
 ds3.head()

C:\Users\NK1O7\AppData\Local\Temp/ipykernel_1412/4189580668.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ds3['fare'] = ds3['fare']/ds3['fare'].max()

    age_in_days      fare  survived
1         13870  0.139136         1
3         12775  0.103644         1
6         19710  0.101229         0
10         1460  0.032596         1
11        21170  0.051822         1

In [341]:
# Min Max Scaling 
ds3['fare'] = (ds3['fare'] - ds3['fare'].min())/(ds3['fare'].max() - ds3['fare'].min())
ds3.head()

C:\Users\NK1O7\AppData\Local\Temp/ipykernel_1412/1015998942.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ds3['fare'] = (ds3['fare'] - ds3['fare'].min())/(ds3['fare'].max() - ds3['fare'].min())

    age_in_days      fare  survived
1         13870  0.139136         1
3         12775  0.103644         1
6         19710  0.101229         0
10         1460  0.032596         1
11        21170  0.051822         1

In [342]:
# z-score normalization (standard score)
ds3['fare'] = (ds3['fare'] - ds3['fare'].mean())/ds3['fare'].std()
ds3.head()

C:\Users\NK1O7\AppData\Local\Temp/ipykernel_1412/662324713.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ds3['fare'] = (ds3['fare'] - ds3['fare'].mean())/ds3['fare'].std()

    age_in_days      fare  survived
1         13870 -0.067057         1
3         12775 -0.309853         1
6         19710 -0.326377         0
10         1460 -0.795891         1
11        21170 -0.664367         1

In [343]:
# Log Transformation 
ds2['fare'] = np.log(ds2['fare'])
ds2.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

,survived,pclass,sex,age_in_days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,3.948596,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,2.815409,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,3.279030,S,First,woman,False,C,Southampton,yes,True

# Bining 
- Binnig is a process of grouping data into discrete intervals(bins or groups)
- convert numerical into categorical data
- for better understading and visulization of data

In [344]:
bins  = np.linspace(min(ds4['age']), max(ds4['age']), 15000)
age_bins = ['Teen', 'Young', 'Adult']
ds4['age_group'] = pd.cut(ds4['age'], bins,  include_lowest=True)
ds4.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,"(21.998, 22.004]"
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,"(37.995, 38.0]"
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,"(25.999, 26.004]"
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,"(34.997, 35.002]"
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,"(34.997, 35.002]"

In [364]:
# converting categorical data to numeric data or dummies
import pandas as pd
df  = sns.load_dataset('titanic')
df = pd.get_dummies(df, columns=['sex'], drop_first=True)

df

# ds4['sex']= pd.get_dummies(ds4['sex'])
# ds4['age_group'] = ds4['age_group'].astype('category')
# ds4['age_group'] = ds4['age_group'].cat.codes

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,sex_male
0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0
889,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1